---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.SpaceSet.IsEmpty
source: html/e86d01b1-579a-a313-af77-78b73ff70c7f.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.